Console.OutputEncoding = System.Text.Encoding.Unicode;
Console.WriteLine("Невідомий голос: Вставай народе! Вликий похід на Данію уже завтра!");
Console.WriteLine("*Ви виходите з палатки і приєднуєтесь до інших у натовп*");
Console.WriteLine("Невідомий голос: Вже завтра день який усі ми чекали! Усю зиму ми готувалися! І цей день прийшов! Завтра вікинги заберуть СВОЄ!");
Console.WriteLine("*Крик натовпу не можна було б заглушити тисяу канонад*");
Console.WriteLine("Невідомий голос: Привітайте нашого вождя БЙОООРНАА!");
Console.WriteLine("*З головної палаьки вийшов кримезний чоловік побачивши його натовп закричав уще гучніш *");
Console.WriteLine("Бйорн: Що ж добрий люде вже завтра ми усі разом підемо у похід,\n АЛЕ ми усі знаємо правила предків є обряд при якому кожний може кинути виклик мені БЙОРНУ ЛЮТОМУ");
Console.WriteLine("Бйорн: НУ ЩО ЧИ знайдеться СМІЛИВЄЦЬ?");

